*---------------------------------------------------------------------* 00000200
*                                                                     * 00000300
*        Module:       ADDUSER                                        * 00000400
*                                                                     * 00000500
*        Author:       Rob Prins                                      * 00000600
*                                                                     * 00000700
*        Attributes:   RENT, REUS.                                    * 00000800
*                                                                     * 00000900
*        Function:     Parse the syntax of the ADDUSER command.       * 00001000
*                      Allocate SYS1.SECURE.CNTL(USERS) and           * 00001100
*                      SYS1.SECURE.SHADOW dynamically with IKJDAIR.   * 00001200
*                      GETMAIN room for 1300 users.                   * 00001300
*                      Add new RAKF users in the USERS table          * 00001400
*                      and add a salt + hashed output of the          * 00001500
*                      password into the SHADOW data set.             * 00001600
*                      Write the USERS table back in the CNTL(USERS). * 00001700
*                      Free the SYS1.SECURE.* data sets.              * 00001800
*                                                                     * 00001900
*        Syntax:       ADDUSER userid PASSWORD(pppppppp) +            * 00002000
*                      DFLTGRP(group) GROUP(grp1 grp2 ...) +          * 00002100
*                      OPERATIONS/NOOPERATIONS SPECIAL/NOSPECIAL      * 00002200
*                                                                     * 00002300
*                      Default: NOSPECIAL  NOOPERATIONS               * 00002400
*                                                                     * 00002500
*                      DFLTGRP may also be coded as DGRP.             * 00002600
*                      GROUP may also be coded as GRP.                * 00002700
*                      PASSWORD may also be coded as PWD.             * 00002800
*                                                                     * 00002900
*        Return codes: 00 - all good.                                 * 00003000
*                      08 - an error occurred, user is notified       * 00003100
*                           with a message                            * 00003200
*                                                                     * 00003300
*---------------------------------------------------------------------* 00003400
ADDUSER  CSECT                                                          00003500
         SAVE  (14,12)                                                  00003600
         LR    R12,R15                                                  00003700
         USING ADDUSER,R12             Base register                    00003800
         LR    R2,R1                   Save parm (CPPL)                 00003900
         GETMAIN RU,LV=WORKL           Obtain savearea + working strg.  00004000
         ST    R1,8(,R13)              Forward pointer                  00004100
         ST    R13,4(,R1)              Backward pointer                 00004200
         LR    R13,R1                  This is our save area            00004300
         USING WORKAREA,R13            Base working storage             00004400
         ST    R2,MYCPPL               Save our CPPL address            00004500
START    DS    0H                                                       00004600
         MVC   RAKFSHAD,MDLSHAD        Move ...                         00004700
         MVC   RAKFUSER,MDLUSER             ... model DCBs              00004800
         XC    DAIR08,DAIR08           Clear IKJDAIR                    00004900
         XC    DAIR18,DAIR18                        ... blocks          00005000
         XC    ANSWER,ANSWER           Clear IKJPARS answer             00005100
         MVC   MSG3,MSG3X              Move message to working storage  00005200
         MVC   MSG4,MSG4X              Move message to working storage  00005300
         MVC   MSG9,MSG9X              Move message to working storage  00005400
         MVI   USERREC-1,C' '          To blank USERREC                 00005500
         MVI   GROUPS,C' '             Blank GROUP fields               00005600
         MVC   GROUPS+1(L'GROUPS-1),GROUPS                              00005700
         MVI   SW,0                    Clear flags                      00005800
         LA    R0,DCBABEND             DCB abend exit                   00005900
         ST    R0,EXLST                Save JFCB in exit list           00006000
         MVI   EXLST,X'91'             DCB abend exit is last entry     00006100
         LA    R0,EXLST                Exit list (DCB abend exit)       00006200
         STCM  R0,B'0111',RAKFUSER+DCBEXLSA-IHADCB                      00006300
         STCM  R0,B'0111',RAKFSHAD+DCBEXLSA-IHADCB                      00006400
         GETMAIN RU,LV=104000      GETMAIN room for 1300 user records   00006500
         ST    R1,ADRUSER              Save its address                 00006600
*---------------------------------------------------------------------* 00006700
*        Parse parameters                                             * 00006800
*---------------------------------------------------------------------* 00006900
         GETMAIN RU,LV=PPL#L           Obtain a dynamic PPL workarea    00007000
         STM   R0,R1,PPL#LA            Save length and address of PPL   00007100
         L     R2,PPL#PTR              Get the address of the PPL       00007200
         USING PPL,R2                  Adress it                        00007300
         L     R1,MYCPPL               Get address of CPPL              00007400
         USING CPPL,R1                 Address it                       00007500
*---------------------------------------------------------------------* 00007600
*                                                                       00007700
*        Populate the Parse Parameter List (PPL) from the CPPL,         00007800
*        add the IKJPARMD list in the PPL and invoke IKJPARS            00007900
*                                                                       00008000
*---------------------------------------------------------------------* 00008100
*                                                                       00008200
         MVC   PPLUPT,CPPLUPT          Put in the UPT address from CPPL 00008300
         MVC   PPLECT,CPPLECT          Put in the ECT address from CPPL 00008400
         MVC   PPLCBUF,CPPLCBUF        Put in the command buffer addr.  00008500
*                                      From the CPPL                    00008600
         XC    ECB,ECB                 Clear Event control block        00008700
         L     R1,=A(ADDPCL)           Address of PCL                   00008800
         ST    R1,PPLPCL               Set in PPL                       00008900
         LA    R1,ANSWER               Answer area                      00009000
         ST    R1,PPLANS               Pointer into PPL                 00009100
         LA    R1,ECB                  Event control block              00009200
         ST    R1,PPLECB               Pointer into PPL                 00009300
         ST    R13,PPLUWA              User provide workarea            00009400
         CALLTSSR EP=IKJPARS,MF=(E,PPL)   Invoke parse                  00009500
         DROP  R1,R2                   CPPL and PPL                     00009600
         LTR   R15,R15                 Parse successfully processed?    00009700
         BZ    PARSEOK                 Yes: carry                       00009800
         LA    R0,L'MSG5               Length                           00009900
         LA    R1,MSG5                 Message                          00010000
         BAL   R14,TPUT                                                 00010100
         B     RC08                    Return to TMP                    00010200
PARSEOK  DS    0H                                                       00010300
         L     R8,ANSWER               Pointer to PDL                   00010400
         USING ADDPRS,R8               mapped with IKJPARM              00010500
         LA    R3,GROUPPDE             Point to Group PDE               00010600
         USING GRPRET,R3               Get addressability of GROUPPDE   00010700
         LA    R4,GROUPS               Point to GROUP table             00010800
         LA    R5,5                    Limit to max. 5 groups           00010900
LOOPGRP  TM    GRP1FLG,$G1PRES         Group 1 present?                 00011000
         BNO   ENDGRP                  No:                              00011100
         L     R1,GRP1PTR              Point to GROUP 1                 00011200
         LH    R2,GRP1L                Length of GROUP                  00011300
         BCTR  R2,0                    -1 for EX                        00011400
         EX    R2,MVEGRP                                                00011500
         LA    R4,8(,R4)               Next group in table              00011600
         ICM   R3,15,NEXTGRP           Next PDE of LIST                 00011700
         BZ    ENDGRP                  No                               00011800
         BCT   R5,LOOPGRP              Loop                             00011900
MVEGRP   MVC   0(0,R4),0(R1)           << Executed >>                   00012000
ENDGRP   DS    0H                                                       00012100
         DROP  R3                      Unbase GRPRET                    00012200
         MVC   USERID,=CL8' '          Initialize UserID                00012300
         LA    R3,UIDPDE               UserID PDE                       00012400
         USING UIDRET,R3               Base this PDE                    00012500
         L     R1,UIDPTR               Pointer to UserID                00012600
         LH    R2,UIDL                 Length                           00012700
         BCTR  R2,0                    -1 for EX                        00012800
         EX    R2,MVEUID               Move UserID                      00012900
         B     ENDUID                  Branch over EX                   00013000
MVEUID   MVC   USERID(0),0(R1)         << Executed >>                   00013100
ENDUID   DS    0H                                                       00013200
         DROP  R3                      Unbase UIDRET                    00013300
         MVC   WORKPASS+1(8),=CL8' '   Initialize Password              00013400
         LA    R3,PASSWPDE             Point to Password PDE            00013500
         USING PASSRET,R3              Base this PDE                    00013600
         TM    PASSFLG,$PWPRES         Is Password present?             00013700
         BNZ   PWD001                  Yes: good                        00013800
         LA    R1,MSG6            Msg: 'PASSWORD and DFLTGRP required'  00013900
         LA    R0,L'MSG6               Length                           00014000
         BAL   R14,TPUT                Write message                    00014100
         B     RC08                    End with RC = 8                  00014200
PWD001   DS    0H                                                       00014300
         LH    R2,PASSL                Length of password               00014400
         STC   R2,WORKPASS             Save password length             00014500
         L     R1,PASSPTR              Password itsself                 00014600
         BCTR  R2,0                    Minus 1 for EX                   00014700
         EX    R2,MVEPAS               Move password                    00014800
         B     ENDPAS                  Branch over EX                   00014900
MVEPAS   MVC   WORKPASS+1(0),0(R1)     << Executed >>                   00015000
ENDPAS   DS    0H                                                       00015100
         DROP  R3                      Unbase PASSRET                   00015200
         MVC   DFLTGRP,=CL8' '         Initialize Default Group         00015300
         LA    R3,DGRPPDE              Point to Default Group PDE       00015400
         USING DFTGRET,R3              Base this PDE                    00015500
         TM    DFTGFLG,$DFPRES         Is Default Group present?        00015600
         BNZ   DFTG001                 Yes: good                        00015700
         LA    R1,MSG6            Msg: 'PASSWORD and DFLTGRP required'  00015800
         LA    R0,L'MSG6               Length                           00015900
         BAL   R14,TPUT                Write message                    00016000
         B     RC08                    End with RC = 8                  00016100
DFTG001  DS    0H                                                       00016200
         LH    R2,DFTGL                Length of Default Group          00016300
         L     R1,DFTGPTR              Group name                       00016400
         BCTR  R2,0                    Minus 1 for EX                   00016500
         EX    R2,MVEDGRP              Move Group name                  00016600
         B     ENDDGRP                 Branch over EX                   00016700
MVEDGRP  MVC   DFLTGRP(0),0(R1)        << Executed >>                   00016800
ENDDGRP  DS    0H                                                       00016900
         DROP  R3                      Unbase DFTGRET                   00017000
         MVI   OPER,C'N'               Default no operations            00017100
         CLI   OPERKW+1,1              Operations?                      00017200
         BNE   SPEC01                  No: good, Yes: also good         00017300
         MVI   OPER,C'Y'               Set operations                   00017400
SPEC01   DS    0H                                                       00017500
         MVI   SPECIAL,C'N'            Default no SPECIAL               00017600
         CLI   SPECKW+1,1              SPECIAL?                         00017700
         BNE   ENDPARS                 No: good, Yes: also good         00017800
         MVI   SPECIAL,C'Y'            Set SPECIAL                      00017900
ENDPARS  DS    0H                                                       00018000
*---------------------------------------------------------------------* 00018100
*        Allocate SYS1.SECURE.CNTL(USERS) and SYS1.SECURE.SHADOW      * 00018200
*---------------------------------------------------------------------* 00018300
         LA    R3,DAIR08               Allocation request block         00018400
         USING DAPB08,R3               Base DAPB08                      00018500
         MVI   DA08CD+1,X'08'          Entry code 08 (allocation)       00018600
         MVC   DA08DDN,=CL8'RAKFUSER'  DDNAME to allocate               00018700
         MVC   DA08PDSN,=A(USRDSNL)    Temporary data set name          00018800
         MVI   DA08DSP1,DA08SHR        DISP=SHR                         00018900
         MVC   DA08MNM,=CL8'USERS'     Fixed member name                00019000
         MVI   DA08UNIT,C' '           Clear unit name                  00019100
         MVC   DA08UNIT+1(L'DA08UNIT-1),DA08UNIT                        00019200
         MVI   DA08SER,C' '            Clear volume serial              00019300
         MVC   DA08SER+1(L'DA08SER-1),DA08UNIT                          00019400
         LR    R1,R3                   Parameter CALLTS                 00019500
         BAL   R14,CALLTS              IKJDAIR routine                  00019600
         LTR   R15,R15                 Allocation OK?                   00019700
         BZ    ADDU001                 Yes: carry on                    00019800
         LA    R1,MSG1                 Msg: 'allocation error USER'     00019900
         LA    R0,L'MSG1               Length                           00020000
         BAL   R14,TPUT                Write the message on screen      00020100
         B     RC08                    Return code 8                    00020200
ADDU001  DS    0H                                                       00020300
         MVC   DA08DDN,=CL8'RAKFSHAD'  DDNAME to allocate               00020400
         MVC   DA08PDSN,=A(SHDDSNL)    Temporary data set name          00020500
         MVI   DA08MNM,C' '            Clear member name                00020600
         MVC   DA08MNM(L'DA08MNM-1),DA08MNM                             00020700
         LR    R1,R3                   Parameter CALLTS                 00020800
         BAL   R14,CALLTS              IKJDAIR routine                  00020900
         LTR   R15,R15                 Allocation OK?                   00021000
         BZ    ADDU003                 Yes: carry on                    00021100
         LA    R1,MSG2                 Msg: 'allocation error SHADOW'   00021200
         LA    R0,L'MSG2               Length                           00021300
         BAL   R14,TPUT                Write the message on screen      00021400
         BAL   R14,FREE                Free the data sets               00021500
         B     RC08                    Return code 8                    00021600
         DROP  R3                      Unbase DABP08                    00021700
ADDU003  DS    0H                                                       00021800
*---------------------------------------------------------------------* 00021900
*        Open SYS1.SECURE.CNTL(USERS) with DDNAME RAKUSER             * 00022000
*---------------------------------------------------------------------* 00022100
         MVI   OPEND,X'80'             First and only DCB               00022200
         OPEN  RAKFUSER,MF=(E,OPEND)                                    00022300
         TM    SW,$913                 Access denied?                   00022400
         BNO   ADDU005                 No: assumed, that open is succes 00022500
         MVC   MSG3+9(8),=CL8'RAKFUSER'  DD-name                        00022600
         LA    R1,MSG3                 Msg: 'xxxxxxxx access denied'    00022700
         LA    R0,L'MSG3               Length                           00022800
         BAL   R14,TPUT                Write the message on screen      00022900
         BAL   R14,FREE                Free the data sets               00023000
         B     RC08                    Return code 8                    00023100
ADDU005  DS    0H                                                       00023200
*---------------------------------------------------------------------* 00023300
*        Open SYS1.SECURE.SHADOW with DDNAME RAKFSHAD                 * 00023400
*---------------------------------------------------------------------* 00023500
         MVI   OPEND,X'80'             First and only DCB               00023600
         OPEN  RAKFSHAD,MF=(E,OPEND)                                    00023700
         TM    SW,$913                 Access denied?                   00023800
         BNO   ADDU007                 No: assumed, that open is succes 00023900
         MVC   MSG3+9(8),=CL8'RAKFSHAD'  DD-name                        00024000
         LA    R1,MSG3                 Msg: 'xxxxxxxx access denied'    00024100
         LA    R0,L'MSG3               Length                           00024200
         BAL   R14,TPUT                Write the message on screen      00024300
         BAL   R14,CLOSE                                                00024400
         BAL   R14,FREE                Free the data sets               00024500
         B     RC08                    Return code 8                    00024600
ADDU007  DS    0H                                                       00024700
*---------------------------------------------------------------------* 00024800
*        Read the USERS records and check if UserID is already        * 00024900
*        added.                                                       * 00025000
*        And populate the table with User records.                    * 00025100
*---------------------------------------------------------------------* 00025200
         XR    R5,R5                   Clear record counter             00025300
         L     R6,ADRUSER              Start of user table              00025400
ADDU009  DS    0H                                                       00025500
         GET   RAKFUSER,USERREC        Read a record                    00025600
         LA    R5,1(,R5)               Count record                     00025700
         C     R5,=F'1295'             Already 1295 records in table?   00025800
         BL    ADDU010                 No: room enough                  00025900
         LA    R1,MSG7                 Msg: 'table full'                00026000
         LA    R0,L'MSG7               Length                           00026100
         BAL   R14,TPUT                Write the message on screen      00026200
         BAL   R14,CLOSE               Close RAKFUSER and RAKFSHAD      00026300
         BAL   R14,FREE                Free the data sets               00026400
         B     RC08                    Return code 8                    00026500
ADDU010  CLC   USERUID,USERID          Match found of UserID?           00026600
         BNE   ADDU011                 No: good                         00026700
         MVC   MSG4+14(8),USERID       Involved UserID                  00026800
         LA    R1,MSG4                 Msg: 'UserID already defined'    00026900
         LA    R0,L'MSG4               Length                           00027000
         BAL   R14,TPUT                Write the message on screen      00027100
         BAL   R14,CLOSE               Close the data sets              00027200
         BAL   R14,FREE                Free the data sets               00027300
         B     RC08                    Return code 8                    00027400
ADDU011  DS    0H                                                       00027500
         MVC   0(80,R6),USERREC        Record into table                00027600
         LA    R6,80(,R6)              Next entry in table              00027700
         B     ADDU009                 Read next record                 00027800
USEREOF  DS    0H                      EOF RACFUSER                     00027900
ADDU013  DS    0H                                                       00028000
*---------------------------------------------------------------------* 00028100
*        Read the SHADOW record and check if UserID is already        * 00028200
*        added.                                                       * 00028300
*---------------------------------------------------------------------* 00028400
         GET   RAKFSHAD,SHADOW         Read a shadow record             00028500
         CLC   SHDUID(8),USERID        Match found of UserID?           00028600
         BNE   ADDU013                 No: read next record             00028700
         MVC   MSG4+7(7),USERID        Involved UserID                  00028800
         LA    R1,MSG4                 Msg: 'Userid already defined'    00028900
         LA    R0,L'MSG4               Length                           00029000
         BAL   R14,TPUT                Write the message on screen      00029100
         BAL   R14,CLOSE               Close the data sets              00029200
         BAL   R14,FREE                Free the data sets               00029300
         B     RC08                    Return code 8                    00029400
SHADEOF  DS    0H                      EOF RACFSHAD                     00029500
*---------------------------------------------------------------------* 00029600
*        Write the User records in the User table.                    * 00029700
*---------------------------------------------------------------------* 00029800
         MVC   USERREC,USERREC-1       Clear user record                00029900
         MVC   USERUID(8),USERID       Move UserID                      00030000
         MVI   USERDFT,C'*'            Default group                    00030100
         MVC   USERGRP,DFLTGRP         Default GROUP name               00030200
         MVC   USERSPE,SPECIAL         Special / Nospecial              00030300
         MVC   USEROPR,OPER            Operations / Nooperations        00030400
         MVC   0(80,R6),USERREC        Move record in table             00030500
         LA    R5,1(,R5)               Count record                     00030600
         LA    R1,GROUPS               Group table                      00030700
         LA    R0,5                    Max 5 groups                     00030800
GROUP01  DS    0H                                                       00030900
         CLC   =CL8' ',0(R1)           No groups anymore?               00031000
         BE    GROUP09                 Yes: skip                        00031100
         CLC   DFLTGRP,0(R1)           Group is already the DFLTGRP?    00031200
         BE    GROUP02                 Yes: skip                        00031300
         MVC   USERGRP,0(R1)           Move Group name                  00031400
         MVI   USERDFT,C' '            Is not the Default GROUP         00031500
         LA    R6,80(,R6)              Next entry in User tablew        00031600
         MVC   0(80,R6),USERREC        Move record in table             00031700
         LA    R5,1(,R5)               Count record                     00031800
GROUP02  LA    R1,8(,R1)               Point to next group              00031900
         BCT   R0,GROUP01              Loop until all done              00032000
GROUP09  DS    0H                                                       00032100
*---------------------------------------------------------------------* 00032200
*        Initialize the Salt with the TOD clock and call RAKFPWH      * 00032300
*---------------------------------------------------------------------* 00032400
         STCK  SALT                    Salt = the TOD clock             00032500
         LA    R0,SALT                 Salt                             00032600
         ST    R0,HWPL+0               In parmlist                      00032700
         LA    R0,WORKPASS+1                                            00032800
         ST    R0,HWPL+4               In parmlist                      00032900
         XR    R1,R1                   Clear register                   00033000
         IC    R1,WORKPASS             Gotten password length           00033100
         ST    R1,HWPWLEN              Save in RAKFPWH list             00033200
         LA    R0,HWPWLEN                                               00033300
         ST    R0,HWPL+8               In parmlist                      00033400
         LA    R0,OUTPUT               Output field                     00033500
         ST    R0,HWPL+12              In parmlist                      00033600
         LA    R0,HWWORK               Work area                        00033700
         ST    R0,HWPL+16              In parmlist                      00033800
         LA    R1,HWPL                 Parmlist                         00033900
         ST    R13,HWR13               Save our area address            00034000
         LR    R4,R13                  Save our area address            00034100
         LA    R13,HWSAVE                                               00034200
         L     R15,=V(RAKFPWH)         Hashing routine                  00034300
         BALR  R14,R15                 Encrypt                          00034400
         LR    R13,R4                  Restore our area address         00034500
         BAL   R14,CLOSE               Close RAKFUSER and RAKFSHAD      00034600
*---------------------------------------------------------------------* 00034700
*        Add the salt + hashed password in the SHADOW data set.       * 00034800
*---------------------------------------------------------------------* 00034900
         MVI   OPEND,X'80'             First and only DCB               00035000
         OPEN  (RAKFSHAD,(EXTEND)),MF=(E,OPEND)                         00035100
         TM    SW,$913                 Access denied?                   00035200
         BNO   ADDU015                 No: assumed, that open is succes 00035300
         MVC   MSG3+9(8),=CL8'RAKFSHAD'  DD-name                        00035400
         B     ADDU016                 Write message                    00035500
ADDU015  MVC   SHDUID,USERID                                            00035600
         MVC   SHDSALT,SALT            Salt                             00035700
         MVC   SHDHASH,OUTPUT          Hash                             00035800
         PUT   RAKFSHAD,SHADOW                                          00035900
         MVI   OPEND,X'80'             First and only DCB               00036000
         OPEN  (RAKFUSER,(OUTPUT)),MF=(E,OPEND)                         00036100
         TM    SW,$913                 Access denied?                   00036200
         BNO   ADDU017                 No: assumed, that open is succes 00036300
         MVC   MSG3+9(8),=CL8'RAKFUSER'  DD-name                        00036400
ADDU016  LA    R1,MSG3                 Msg: 'xxxxxxxx access denied'    00036500
         LA    R0,L'MSG3               Length                           00036600
         BAL   R14,TPUT                Write the message on screen      00036700
         BAL   R14,CLOSE               Close the DCBs                   00036800
         BAL   R14,FREE                Free the data sets               00036900
         B     RC08                    Return code 8                    00037000
ADDU017  L     R6,ADRUSER              Max 1000 user entries            00037100
*---------------------------------------------------------------------* 00037200
*        Write the RAKF Users back in the USERS member.               * 00037300
*---------------------------------------------------------------------* 00037400
ADDU019  DS    0H                                                       00037500
         PUT   RAKFUSER,0(R6)          Write ...                        00037600
         LA    R6,80(,R6)                    User ...                   00037700
         BCT   R5,ADDU019                         table back            00037800
         MVC   MSG9+14(8),USERID       UserID in success message        00037900
         LA    R1,MSG9                 Success message                  00038000
         LA    R0,L'MSG9               Length                           00038100
         BAL   R14,TPUT                Write the message on screen      00038200
         LA    R1,MSGA                 Msg: Run RAKFUSER ...            00038300
         LA    R0,L'MSGA               Length                           00038400
         BAL   R14,TPUT                Write the message on screen      00038500
         BAL   R14,CLOSE               Close the data sets              00038600
         BAL   R14,FREE                And unallocate                   00038700
         LA    R15,0                   RC = 0                           00038800
         B     RETURN                                                   00038900
*---------------------------------------------------------------------* 00039000
*        Return to TSO TMP.                                           * 00039100
*---------------------------------------------------------------------* 00039200
RC08     DS    0H                                                       00039300
         LA    R15,8                   RC = 8                           00039400
RETURN   DS    0H                                                       00039500
         LR    R4,R15                  Save return code                 00039600
         LM    R2,R3,PPL#LA            Load length and address of PPL   00039700
         FREEMAIN RU,LV=(2),A=(3)      Free the PPL                     00039800
         ICM   R8,15,ANSWER            Pointer to PDE's (the PDL)       00039900
         BZ    RETURN2                 No: skip                         00040000
         IKJRLSA (R8)                  Release PARSE storage            00040100
RETURN2  L     R2,ADRUSER              Address of user table            00040200
         FREEMAIN RU,LV=104000,A=(2)                                    00040300
         LR    R3,R13                  Load working storage to free     00040400
         L     R13,4(,R13)             Load caller's save area          00040500
         FREEMAIN RU,LV=WORKL,A=(3)    Release working storage          00040600
         LR    R15,R4                  Restore return code              00040700
         RETURN (14,12),RC=(15)        Return                           00040800
*                                                                       00040900
         TITLE 'Invoke IKJDAIR, A(Parm block) in R1'                    00041000
*---------------------------------------------------------------------* 00041100
*        Routine:   CALLTS                                            * 00041200
*        Function:  Invoke IKJDAIR to allocate or unallocate data sets* 00041300
*                   Register 1 contains the address of the allocation * 00041400
*                   or unallocation DAIR parameter blocks.            * 00041500
*---------------------------------------------------------------------* 00041600
CALLTS   DS    0H                                                       00041700
         ST    R14,R14TS               Save register 14                 00041800
         LR    R14,R1                  Save A(IKJDAIR parm block)       00041900
         XC    ECB,ECB                 Clear ECB                        00042000
         LA    R1,DAIRDAPL                                              00042100
         L     R2,MYCPPL               Pickup our CPPL                  00042200
         USING CPPL,R2                 Base CPPL                        00042300
         USING DAPL,R1                 Base IKJDAPL                     00042400
         MVC   DAPLUPT(4),CPPLUPT                                       00042500
         MVC   DAPLECT(4),CPPLECT                                       00042600
         XC    ECB,ECB                 Clear Event control block        00042700
         LA    R0,ECB                  Address of our ECB               00042800
         ST    R0,DAPLECB              Set A(ECB) in DAPL               00042900
         MVC   DAPLPSCB(4),CPPLPSCB                                     00043000
         ST    R14,DAPLDAPB            Set A(parm block) in DAPL        00043100
         CALLTSSR EP=IKJDAIR,MF=(E,DAIRDAPL)                            00043200
         L     R14,R14TS               Restore register 14              00043300
         BR    R14                                                      00043400
         DROP  R1,R2                   Unbase DAPL and CPPL             00043500
         TITLE 'Write message on screen, r0=length, r1=address msg'     00043600
TPUT     DS    0H                                                       00043700
         ST    R14,R14TPUT             Save register 14                 00043800
         TPUT  (1),(0),R                                                00043900
         L     R14,R14TPUT             Restore register 14              00044000
         BR    R14                     Return                           00044100
         TITLE 'Free SYS.SECURE.CNTL and SYS1.SECURE.SHADOW'            00044200
FREE     DS    0H                                                       00044300
         ST    R14,R14FREE             Save register 14                 00044400
         LA    R3,DAIR18               Point to unallocation parm block 00044500
         XC    DAIR18,DAIR18           Clear unallocation parm block    00044600
         USING DAPB18,R3               IKJDAP18                         00044700
         MVI   DA18CD+1,X'18'          Entry code 0018 (unallocate)     00044800
         MVI   DA18MNM,C' '            Provide no ...                   00044900
         MVC   DA18MNM+1(7),DA18MNM               member name           00045000
         MVC   DA18DDN,=CL8'RAKFUSER'  DDNAME to unallocate             00045100
         LR    R1,R3                   Parameter CALLTS                 00045200
         BAL   R14,CALLTS              IKJDAIR routine                  00045300
         MVC   DA18DDN,=CL8'RAKFSHAD'  DDNAME to unallocate             00045400
         LR    R1,R3                   Parameter CALLTS                 00045500
         BAL   R14,CALLTS              IKJDAIR routine                  00045600
         L     R14,R14FREE             Restore register 14              00045700
         BR    R14                     Return                           00045800
         DROP  R3                      Unbase DAPB18                    00045900
         TITLE 'Close RAKFUSER and RAKFSHAD'                            00046000
CLOSE    ST    R14,R14CLOSE            Save register 14                 00046100
         MVI   CLOSED,X'80'            First and only DCB               00046200
         CLOSE RAKFUSER,MF=(E,CLOSED)                                   00046300
         MVI   CLOSED,X'80'            First and only DCB               00046400
         CLOSE RAKFSHAD,MF=(E,CLOSED)                                   00046500
         L     R14,R14CLOSE            Restore register 14              00046600
         BR    R14                     Return                           00046700
         TITLE 'DCB abend exit'                                         00046800
DCBABEND DS    0H                                                       00046900
         TM    3(R1),B'00001110'       Processing allowed?              00047000
         BZR   R14                     No: continue with abend          00047100
         TM    3(R1),4                 Ignore bit on?                   00047200
         MVI   3(R1),0                 Prepare for NO                   00047300
         BZR   R14                                                      00047400
         MVC   DCBCOMP,0(R1)           Move completion code             00047500
         NC    DCBCOMP,=X'FFF0'        Clear last nibble                00047600
         CLC   DCBCOMP,=X'9130'        Do we have an RACF/ACF2 abend?   00047700
         BNER  R14                     No: continue with abend          00047800
         MVI   3(R1),4                 Yes: ignore abend                00047900
         OI    SW,$913                 Indicate 913 abend               00048000
         BR    R14                     Return to Access Method          00048100
PCLSTART DS    0H                                                       00048200
ADDPCL   IKJPARM DSECT=ADDPRS          PDE's                            00048300
UIDPDE   IKJPOSIT JOBNAME,PROMPT='RAKF UserID',                        *00048400
               HELP=('Enter a valid UserID')                            00048500
PASSWKW  IKJKEYWD                                                       00048600
         IKJNAME 'PASSWORD',SUBFLD=PASSWSF,ALIAS='PWD'                  00048700
DFTGRPKW IKJKEYWD                                                       00048800
         IKJNAME 'DFLTGRP',SUBFLD=DGRPSF,ALIAS='DGRP'                   00048900
GROUPKW  IKJKEYWD                                                       00049000
         IKJNAME 'GROUP',SUBFLD=GROUPSF,ALIAS='GRP'                     00049100
OPERKW   IKJKEYWD  DEFAULT='NOOPERATIONS'                               00049200
         IKJNAME 'OPERATIONS'                                           00049300
         IKJNAME 'NOOPERATIONS'                                         00049400
SPECKW   IKJKEYWD DEFAULT='NOSPECIAL'                                   00049500
         IKJNAME 'SPECIAL'                                              00049600
         IKJNAME 'NOSPECIAL'                                            00049700
PASSWSF  IKJSUBF                                                        00049800
PASSWPDE IKJIDENT 'Password',                                          *00049900
               FIRST=ALPHANUM,OTHER=ALPHANUM,MAXLNTH=8,                *00050000
               PROMPT='Enter a valid password',VALIDCK=PWCHK,          *00050100
               HELP='Specify a password with at least 4 characters'     00050200
DGRPSF   IKJSUBF                                                        00050300
DGRPPDE  IKJIDENT 'Default group',                                     *00050400
               FIRST=ALPHA,OTHER=ALPHANUM,MAXLNTH=8,                   *00050500
               PROMPT='Default RAKF group'                              00050600
GROUPSF  IKJSUBF                                                        00050700
GROUPPDE IKJIDENT 'Group',LIST,                                        *00050800
               FIRST=ALPHA,OTHER=ALPHANUM,MAXLNTH=8,                   *00050900
               PROMPT='One or more RAKF groups'                         00051000
         IKJENDP                                                        00051100
PCL#L    EQU   *-PCLSTART                                               00051200
         TITLE 'CONSTANTS'                                              00051300
MDLSHAD  DCB   DSORG=PS,LRECL=48,DDNAME=RAKFSHAD,EODAD=SHADEOF,        *00051400
               MACRF=(GM,PM)                                            00051500
MDLSLEN  EQU   *-MDLSHAD                                                00051600
MDLUSER  DCB   DSORG=PS,LRECL=80,DDNAME=RAKFUSER,EODAD=USEREOF,        *00051700
               MACRF=(GM,PM)                                            00051800
MDLULEN  EQU   *-MDLUSER                                                00051900
*                                                                       00052000
USRDSNL  DC    AL2(L'USRDSN)                                            00052100
USRDSN   DC    C'SYS1.SECURE.CNTL'     RAKF control data set            00052200
SHDDSNL  DC    AL2(L'SHDDSN)                                            00052300
SHDDSN   DC    C'SYS1.SECURE.SHADOW'   RAKF data set with encrypted psw 00052400
*                                                                       00052500
MSG1     DC    C'SYS1.SECURE.USER could not be allocated'               00052600
MSG2     DC    C'SYS1.SECURE.SHADOW could not be allocated'             00052700
MSG3X    DC    C'ADDUSER: xxxxxxxx access denied'  +9                   00052800
MSG4X    DC    C'ADDUSER: User xxxxxxxx already defined'                00052900
MSG5     DC    C'ADDUSER: Parse error'                                  00053000
MSG6     DC    C'ADDUSER: PASSWORD(pppp) and DFLTGRP(gggg) are required*00053100
               '                                                        00053200
MSG7     DC    C'ADDUSER: User table full, too many users'              00053300
MSG9X    DC    C'ADDUSER: User xxxxxxxx successfully defined'           00053400
MSGA     DC    C'ADDUSER: Run RAKFUSER to activate the changes'         00053500
         LTORG ,                                                        00053600
         DROP                                                           00053700
*---------------------------------------------------------------------* 00053800
*        Validate Presence of the Password                            * 00053900
*---------------------------------------------------------------------* 00054000
PWCHK    DS    0H                                                       00054100
         STM   R14,R12,12(R13)         Save registers                   00054200
         LR    R12,R15                 Load base register               00054300
         USING PWCHK,R12                                                00054400
         L     R3,0(,R1)               Point to PASSWORD PDE            00054500
         USING PASSRET,R3              Address it                       00054600
         SR    R15,R15                 Default return code 0            00054700
         TM    PASSFLG,$PWPRES         Was keyword present?             00054800
         BNZ   PW02                    Yes: good                        00054900
         LA    R15,4                   Return code 4                    00055000
PW02     DS    0H                                                       00055100
         LH    R1,PASSL                Length                           00055200
         CH    R1,=H'3'                At least 4 bytes long            00055300
         BH    PWEXIT                  Yes: good                        00055400
         LA    R15,4                   Return code 4                    00055500
PWEXIT   L     R14,12(,R13)            Restore register 14              00055600
         LM    R0,R12,20(R13)          Restore other registers          00055700
         BR    R14                     Return to caller                 00055800
         DROP  R3,R12                  Unbase PASSRET and PWCHK         00055900
         LTORG ,                                                        00056000
*                                                                       00056100
GRPRET   DSECT                         LIST PDE of GROUP                00056200
GRP1PTR  DS    F                       Pointer to GROUP                 00056300
GRP1L    DS    H                       Length of GROUP                  00056400
GRP1FLG  DS    C                                                        00056500
$G1PRES  EQU   128                     Group(s) are present             00056600
         DS    C                       Reserved                         00056700
NEXTGRP  DS    F                       Next PDE                         00056800
*                                                                       00056900
UIDRET   DSECT                         PDE of UserID                    00057000
UIDPTR   DS    F                       Pointer to UserID                00057100
UIDL     DS    H                       Length of UserID                 00057200
UIDFLG   DS    C                                                        00057300
$UPRES   EQU   128                     Group(s) are present             00057400
         DS    C                       Reserved                         00057500
*                                                                       00057600
PASSRET  DSECT                         PDE of Password                  00057700
PASSPTR  DS    F                       Pointer to Password              00057800
PASSL    DS    H                       Length of Password               00057900
PASSFLG  DS    C                                                        00058000
$PWPRES  EQU   128                     Password is present              00058100
         DS    C                       Reserved                         00058200
*                                                                       00058300
DFTGRET  DSECT                         PDE of Default GROUP             00058400
DFTGPTR  DS    F                       Pointer to default group         00058500
DFTGL    DS    H                       Length of group                  00058600
DFTGFLG  DS    C                                                        00058700
$DFPRES  EQU   128                     Default group is present         00058800
         DS    C                       Reserved                         00058900
*                                                                       00059000
WORKAREA DSECT                         Working storage                  00059100
         DS    18F                     Our save area                    00059200
MYCPPL   DS    F                                                        00059300
DAIRDAPL DS    5F                      DAIR parameter list              00059400
ECB      DS    F                       For IKJDAIR                      00059500
R14CLOSE DS    F                       Register 14 CLOSE                00059600
R14FREE  DS    F                       Register 14 FREE                 00059700
R14TPUT  DS    F                       Register 14 TPUT                 00059800
R14TS    DS    F                       Register 14 CALLTS               00059900
EXLST    DS    F                       DCB abend exit                   00060000
OPEND    DS    F                       OPEN MF=L                        00060100
CLOSED   DS    F                       CLOSE MF=L                       00060200
ADRUSER  DS    F                       Address of 1000 user entries     00060300
ANSWER   DS    F                       Parse answer area                00060400
SALT     DS    CL8                     SALT is equal to TOD clock       00060500
USERID   DS    CL8                     To receive UserID                00060600
DFLTGRP  DS    CL8                     To receive default Group name    00060700
*                                                                       00060800
GROUPS   DS    CL40                    To receive max. 5 groups         00060900
*                                                                       00061000
DCBCOMP  DS    H                       Completion code in DCBABEND      00061100
*                                                                       00061200
HASHWKD  DS    0CL772                  Area for RAKFPWH                 00061300
HWPL     DS    5F                    parmlist (salt,pw,pwlen,out,work)  00061400
HWPWLEN  DS    F                       Candidate password length        00061500
HWR13    DS    F                       saved caller save-area pointer   00061600
HWOUT    DS    CL32                    computed SHA-256 hash            00061700
HWSAVE   DS    18F                     save area for the RAKFPWH call   00061800
HWWORK   DS    CL640                   RAKFPWH work area (>= RPWWORKL)  00061900
*                                                                       00062000
OUTPUT   DS    CL32                    Hashed output field              00062100
RAKFSHAD DS    CL(MDLSLEN)                                              00062200
RAKFUSER DS    CL(MDLULEN)                                              00062300
*                                                                       00062400
SHADOW   DS    0CL48                   Shadow record                    00062500
SHDUID   DS    CL8                     UserID (key)                     00062600
SHDSALT  DS    CL8                     SALT                             00062700
SHDHASH  DS    CL32                    HASH                             00062800
*                                                                       00062900
         DS    C                       -1                               00063000
USERREC  DS    0CL80                   User record                      00063100
USERUID  DS    CL8                     Contains UserID                  00063200
USERDFT  DS    C                       * for default group              00063300
USERGRP  DS    CL8                     Group                            00063400
         DS    C                                                        00063500
USERPWD  DS    CL8                     Password is blanked out          00063600
         DS    C                                                        00063700
USEROPR  DS    C                       Operations / Nooperations        00063800
         DS    C                                                        00063900
USERSPE  DS    C                       Special / Nospecial              00064000
         DS    CL50                    Filler                           00064100
*                                                                       00064200
PPL#LA   DS    F                       \___ Length + address PPL ____/  00064300
PPL#PTR  DS    F                       /                             \  00064400
*                                                                       00064500
DAIR08   DS    CL84                    Allocation parm block            00064600
DAIR18   DS    CL40                    Unallocation parm block          00064700
*                                                                       00064800
MSG3     DS    CL(L'MSG3X)                                              00064900
MSG4     DS    CL(L'MSG4X)                                              00065000
MSG9     DS    CL(L'MSG9X)                                              00065100
SW       DS    X                       Flags                            00065200
$913     EQU   128                     913 abend occurred               00065300
*                                                                       00065400
SPECIAL  DS    C                       Y or N for SPECIAL               00065500
OPER     DS    C                       Y or N for OPERATIONS            00065600
WORKPASS DS    CL9                     1 byte length + password         00065700
WORKL    EQU   *-WORKAREA              Length of working storage        00065800
*                                                                       00065900
         CVT   DSECT=YES,LIST=NO                                        00066000
         IKJCPPL                                                        00066100
         IKJUPT                                                         00066200
         IKJPPL                        Parse parameter list             00066300
PPL#L    EQU   *-PPL                                                    00066400
         IKJDAPL                                                        00066500
         IKJDAP08                      IKJDAIR allocation parm block    00066600
         IKJDAP18                      IKJDAIR unallocation parm block  00066700
         PRINT NOGEN                                                    00066800
         DCBD  DSORG=PS,DEVD=DA                                         00066900
*                                                                       00067000
R0       EQU   0                                                        00067100
R1       EQU   1                                                        00067200
R2       EQU   2                                                        00067300
R3       EQU   3                                                        00067400
R4       EQU   4                                                        00067500
R5       EQU   5                       Counter number of USER records   00067600
R6       EQU   6                       Address of USER entry in table   00067700
R7       EQU   7                                                        00067800
R8       EQU   8                       Address of IKJPARS PDL           00067900
R9       EQU   9                                                        00068000
R10      EQU   10                                                       00068100
R11      EQU   11                                                       00068200
R12      EQU   12                      Base register                    00068300
R13      EQU   13                      Address of working storage       00068400
R14      EQU   14                                                       00068500
R15      EQU   15                                                       00068600
         END                                                            00068700
