ADDUSER  TITLE 'Add RAKF users with encrypted passwords'                00000100
*---------------------------------------------------------------------* 00000200
*                                                                     * 00000300
*        Module:       ADDUSER                                        * 00000400
*                                                                     * 00000500
*        Author:       Rob Prins                                      * 00000600
*                                                                     * 00000700
*        Attributes:   RENT, REUS.                                    * 00000800
*                                                                     * 00000900
*        Function:     Parse the syntax of the ADDUSER command.       * 00001000
*                      Allocate SYS1.SECURE.CNTL(USERS) and           * 00001100
*                      SYS1.SECURE.SHADOW dynamically with IKJDAIR.   * 00001201
*                      GETMAIN room for 1300 users.                   * 00001300
*                      Add new RAKF users in the USERS table          * 00001400
*                      and add a salt + hashed output of the          * 00001500
*                      password into the SHADOW data set.             * 00001600
*                      Write the USERS table back in the CNTL(USERS). * 00001700
*                      Free the SYS1.SECURE.* data sets.              * 00001800
*                                                                     * 00001900
*        Syntax:       ADDUSER userid PASSWORD(pppppppp) +            * 00002000
*                      DFLTGRP(group) GROUP(grp1 grp2 ...) +          * 00002100
*                      OPERATIONS/NOOPERATIONS SPECIAL/NOSPECIAL      * 00002200
*                                                                     * 00002300
*                      Default: NOSPECIAL  NOOPERATIONS               * 00002400
*                                                                     * 00002500
*                      DFLTGRP may also be coded as DGRP.             * 00002600
*                      GROUP may also be coded as GRP.                * 00002700
*                      PASSWORD may also be coded as PWD.             * 00002800
*                                                                     * 00002900
*        Return codes: 00 - all good.                                 * 00003000
*                      08 - an error occurred, user is notified       * 00003100
*                           with a message                            * 00003200
*                                                                     * 00003300
*---------------------------------------------------------------------* 00003400
ADDUSER  CSECT                                                          00003500
         SAVE  (14,12)                                                  00003600
         LR    R12,R15                                                  00003700
         USING ADDUSER,R12             Base register                    00003800
         LR    R2,R1                   Save parm (CPPL)                 00003900
         GETMAIN RU,LV=WORKL           Obtain savearea + working strg.  00004000
         ST    R1,8(,R13)              Forward pointer                  00004100
         ST    R13,4(,R1)              Backward pointer                 00004200
         LR    R13,R1                  This is our save area            00004300
         USING WORKAREA,R13            Base working storage             00004400
         ST    R2,MYCPPL               Save our CPPL address            00004500
START    DS    0H                                                       00004600
         MVC   RAKFSHAD,MDLSHAD        Move ...                         00004700
         MVC   RAKFUSER,MDLUSER             ... model DCBs              00004800
         XC    DAIR08,DAIR08           Clear IKJDAIR                    00004900
         XC    DAIR18,DAIR18                        ... blocks          00005000
         XC    ANSWER,ANSWER           Clear IKJPARS answer             00005100
         MVC   MSG3,MSG3X              Move message to working storage  00005200
         MVC   MSG4,MSG4X              Move message to working storage  00005300
         MVC   MSG9,MSG9X              Move message to working storage  00005400
         MVI   USERREC-1,C' '          To blank USERREC                 00005500
         MVI   GROUPS,C' '             Blank GROUP fields               00005600
         MVC   GROUPS+1(L'GROUPS-1),GROUPS                              00005700
         MVI   SW,0                    Clear flags                      00005800
         LA    R0,DCBABEND             DCB abend exit                   00005900
         ST    R0,EXLST                Save JFCB in exit list           00006000
         MVI   EXLST,X'91'             DCB abend exit is last entry     00006100
         LA    R0,EXLST                Exit list (JFCB + DCB abend)     00006200
         STCM  R0,B'0111',RAKFUSER+DCBEXLSA-IHADCB                      00006300
         GETMAIN RU,LV=104000      GETMAIN room for 1300 user records   00006400
         ST    R1,ADRUSER              Save its address                 00006500
*---------------------------------------------------------------------* 00006600
*        Parse parameters                                             * 00006700
*---------------------------------------------------------------------* 00006800
         GETMAIN RU,LV=PPL#L           Obtain a dynamic PPL workarea    00006900
         STM   R0,R1,PPL#LA            Save length and address of PPL   00007000
         L     R2,PPL#PTR              Get the address of the PPL       00007100
         USING PPL,R2                  Adress it                        00007200
         L     R1,MYCPPL               Get address of CPPL              00007300
         USING CPPL,R1                 Address it                       00007400
*---------------------------------------------------------------------* 00007500
*                                                                       00007600
*        Populate the Parse Parameter List (PPL) from the CPPL,         00007700
*        add the IKJPARMD list in the PPL and invoke IKJPARS            00007800
*                                                                       00007900
*---------------------------------------------------------------------* 00008000
*                                                                       00008100
         MVC   PPLUPT,CPPLUPT          Put in the UPT address from CPPL 00008200
         MVC   PPLECT,CPPLECT          Put in the ECT address from CPPL 00008300
         MVC   PPLCBUF,CPPLCBUF        Put in the command buffer addr.  00008400
*                                      From the CPPL                    00008500
         XC    ECB,ECB                 Clear Event control block        00008600
         L     R1,=A(ADDPCL)           Address of PCL                   00008700
         ST    R1,PPLPCL               Set in PPL                       00008800
         LA    R1,ANSWER               Answer area                      00008900
         ST    R1,PPLANS               Pointer into PPL                 00009000
         LA    R1,ECB                  Event control block              00009100
         ST    R1,PPLECB               Pointer into PPL                 00009200
         ST    R13,PPLUWA              User provide workarea            00009300
         CALLTSSR EP=IKJPARS,MF=(E,PPL)   Invoke parse                  00009400
         DROP  R1,R2                   CPPL and PPL                     00009500
         LTR   R15,R15                 Parse successfully processed?    00009600
         BZ    PARSEOK                 Yes: carry                       00009700
         LA    R0,L'MSG5               Length                           00009800
         LA    R1,MSG5                 Message                          00009900
         BAL   R14,TPUT                                                 00010000
         B     RC08                    Return to TMP                    00010100
PARSEOK  DS    0H                                                       00010200
         L     R8,ANSWER               Pointer to PDL                   00010300
         USING ADDPRS,R8               mapped with IKJPARM              00010400
         LA    R3,GROUPPDE             Point to Group PDE               00010500
         USING GRPRET,R3               Get addressability of GROUPPDE   00010600
         LA    R4,GROUPS               Point to GROUP table             00010700
         LA    R5,5                    Limit to max. 5 groups           00010800
LOOPGRP  TM    GRP1FLG,$G1PRES         Group 1 present?                 00010900
         BNO   ENDGRP                  No:                              00011000
         L     R1,GRP1PTR              Point to GROUP 1                 00011100
         LH    R2,GRP1L                Length of GROUP                  00011200
         BCTR  R2,0                    -1 for EX                        00011300
         EX    R2,MVEGRP                                                00011400
         LA    R4,8(,R4)               Next group in table              00011500
         ICM   R3,15,NEXTGRP           Next PDE of LIST                 00011600
         BZ    ENDGRP                  No                               00011700
         BCT   R5,LOOPGRP              Loop                             00011800
MVEGRP   MVC   0(0,R4),0(R1)           << Executed >>                   00011900
ENDGRP   DS    0H                                                       00012000
         DROP  R3                      Unbase GRPRET                    00012100
         MVC   USERID,=CL8' '          Initialize UserID                00012200
         LA    R3,UIDPDE               UserID PDE                       00012300
         USING UIDRET,R3               Base this PDE                    00012400
         L     R1,UIDPTR               Pointer to UserID                00012500
         LH    R2,UIDL                 Length                           00012600
         BCTR  R2,0                    -1 for EX                        00012700
         EX    R2,MVEUID               Move UserID                      00012800
         B     ENDUID                  Branch over EX                   00012900
MVEUID   MVC   USERID(0),0(R1)         << Executed >>                   00013000
ENDUID   DS    0H                                                       00013100
         DROP  R3                      Unbase UIDRET                    00013200
         MVC   WORKPASS+1(8),=CL8' '   Initialize Password              00013300
         LA    R3,PASSWPDE             Point to Password PDE            00013400
         USING PASSRET,R3              Base this PDE                    00013500
         TM    PASSFLG,$PWPRES         Is Password present?             00013600
         BNZ   PWD001                  Yes: good                        00013700
         LA    R1,MSG6            Msg: 'PASSWORD and DFLTGRP required'  00013800
         LA    R0,L'MSG6               Length                           00013900
         BAL   R14,TPUT                Write message                    00014000
         B     RC08                    End with RC = 8                  00014100
PWD001   DS    0H                                                       00014200
         LH    R2,PASSL                Length of password               00014300
         STC   R2,WORKPASS             Save password length             00014400
         L     R1,PASSPTR              Password itsself                 00014500
         BCTR  R2,0                    Minus 1 for EX                   00014600
         EX    R2,MVEPAS               Move password                    00014700
         B     ENDPAS                  Branch over EX                   00014800
MVEPAS   MVC   WORKPASS+1(0),0(R1)     << Executed >>                   00014900
ENDPAS   DS    0H                                                       00015000
         DROP  R3                      Unbase PASSRET                   00015100
         MVC   DFLTGRP,=CL8' '         Initialize Default Group         00015200
         LA    R3,DGRPPDE              Point to Default Group PDE       00015300
         USING DFTGRET,R3              Base this PDE                    00015400
         TM    DFTGFLG,$DFPRES         Is Default Group present?        00015500
         BNZ   DFTG001                 Yes: good                        00015600
         LA    R1,MSG6            Msg: 'PASSWORD and DFLTGRP required'  00015700
         LA    R0,L'MSG6               Length                           00015800
         BAL   R14,TPUT                Write message                    00015900
         B     RC08                    End with RC = 8                  00016000
DFTG001  DS    0H                                                       00016100
         LH    R2,DFTGL                Length of Default Group          00016200
         L     R1,DFTGPTR              Group name                       00016300
         BCTR  R2,0                    Minus 1 for EX                   00016400
         EX    R2,MVEDGRP              Move Group name                  00016500
         B     ENDDGRP                 Branch over EX                   00016600
MVEDGRP  MVC   DFLTGRP(0),0(R1)        << Executed >>                   00016700
ENDDGRP  DS    0H                                                       00016800
         DROP  R3                      Unbase DFTGRET                   00016900
         MVI   OPER,C'N'               Default no operations            00017000
         CLI   OPERKW+1,1              Operations?                      00017100
         BNE   SPEC01                  No: good, Yes: also good         00017200
         MVI   OPER,C'Y'               Set operations                   00017300
SPEC01   DS    0H                                                       00017400
         MVI   SPECIAL,C'N'            Default no SPECIAL               00017500
         CLI   SPECKW+1,1              SPECIAL?                         00017600
         BNE   ENDPARS                 No: good, Yes: also good         00017700
         MVI   SPECIAL,C'Y'            Set SPECIAL                      00017800
ENDPARS  DS    0H                                                       00017900
*---------------------------------------------------------------------* 00018000
*        Allocate SYS1.SECURE.CNTL(USERS) and SYS1.SECURE.SHADOW      * 00018100
*---------------------------------------------------------------------* 00018200
         LA    R3,DAIR08               Allocation request block         00018300
         USING DAPB08,R3               Base DAPB08                      00018400
         MVI   DA08CD+1,X'08'          Entry code 08 (allocation)       00018500
         MVC   DA08DDN,=CL8'RAKFUSER'  DDNAME to allocate               00018600
         MVC   DA08PDSN,=A(USRDSNL)    Temporary data set name          00018700
         MVI   DA08DSP1,DA08SHR        DISP=SHR                         00018800
         MVC   DA08MNM,=CL8'USERS'     Fixed member name                00018900
         MVI   DA08UNIT,C' '           Clear unit name                  00019000
         MVC   DA08UNIT+1(L'DA08UNIT-1),DA08UNIT                        00019100
         MVI   DA08SER,C' '            Clear volume serial              00019200
         MVC   DA08SER+1(L'DA08SER-1),DA08UNIT                          00019300
         LR    R1,R3                   Parameter CALLTS                 00019400
         BAL   R14,CALLTS              IKJDAIR routine                  00019500
         LTR   R15,R15                 Allocation OK?                   00019600
         BZ    ADDU001                 Yes: carry on                    00019700
         LA    R1,MSG1                 Msg: 'allocation error USER'     00019800
         LA    R0,L'MSG1               Length                           00019900
         BAL   R14,TPUT                Write the message on screen      00020000
         B     RC08                    Return code 8                    00020100
ADDU001  DS    0H                                                       00020200
         MVC   DA08DDN,=CL8'RAKFSHAD'  DDNAME to allocate               00020300
         MVC   DA08PDSN,=A(SHDDSNL)    Temporary data set name          00020400
         MVI   DA08MNM,C' '            Clear member name                00020500
         MVC   DA08MNM(L'DA08MNM-1),DA08MNM                             00020600
         LR    R1,R3                   Parameter CALLTS                 00020700
         BAL   R14,CALLTS              IKJDAIR routine                  00020800
         LTR   R15,R15                 Allocation OK?                   00020900
         BZ    ADDU003                 Yes: carry on                    00021000
         LA    R1,MSG2                 Msg: 'allocation error SHADOW'   00021100
         LA    R0,L'MSG2               Length                           00021200
         BAL   R14,TPUT                Write the message on screen      00021300
         BAL   R14,FREE                Free the data sets               00021400
         B     RC08                    Return code 8                    00021500
         DROP  R3                      Unbase DABP08                    00021600
ADDU003  DS    0H                                                       00021700
*---------------------------------------------------------------------* 00021800
*        Open SYS1.SECURE.CNTL(USERS) with DDNAME RAKUSER             * 00021900
*---------------------------------------------------------------------* 00022000
         MVI   OPEND,X'80'             First and only DCB               00022100
         OPEN  RAKFUSER,MF=(E,OPEND)                                    00022200
         TM    SW,$913                 Access denied?                   00022300
         BNO   ADDU005                 No: assumed, that open is succes 00022400
         MVC   MSG3+9(8),=CL8'RAKFUSER'  DD-name                        00022500
         LA    R1,MSG3                 Msg: 'xxxxxxxx access denied'    00022600
         LA    R0,L'MSG3               Length                           00022700
         BAL   R14,TPUT                Write the message on screen      00022800
         BAL   R14,FREE                Free the data sets               00022900
         B     RC08                    Return code 8                    00023000
ADDU005  DS    0H                                                       00023100
*---------------------------------------------------------------------* 00023200
*        Open SYS1.SECURE.SHADOW with DDNAME RAKFSHAD                 * 00023300
*---------------------------------------------------------------------* 00023400
         MVI   OPEND,X'80'             First and only DCB               00023500
         OPEN  RAKFSHAD,MF=(E,OPEND)                                    00023600
         TM    SW,$913                 Access denied?                   00023700
         BNO   ADDU007                 No: assumed, that open is succes 00023800
         MVC   MSG3+9(8),=CL8'RAKFSHAD'  DD-name                        00023900
         LA    R1,MSG3                 Msg: 'xxxxxxxx access denied'    00024000
         LA    R0,L'MSG3               Length                           00024100
         BAL   R14,TPUT                Write the message on screen      00024200
         BAL   R14,CLOSE                                                00024300
         BAL   R14,FREE                Free the data sets               00024400
         B     RC08                    Return code 8                    00024500
ADDU007  DS    0H                                                       00024600
*---------------------------------------------------------------------* 00024700
*        Read the USERS records and check if UserID is already        * 00024800
*        added.                                                       * 00024900
*        And populate the table with User records.                    * 00025000
*---------------------------------------------------------------------* 00025100
         XR    R5,R5                   Clear record counter             00025200
         L     R6,ADRUSER              Start of user table              00025300
ADDU009  DS    0H                                                       00025400
         GET   RAKFUSER,USERREC        Read a record                    00025500
         LA    R5,1(,R5)               Count record                     00025600
         C     R5,=F'1295'             Already 1295 records in table?   00025700
         BL    ADDU010                 No: room enough                  00025800
         LA    R1,MSG7                 Msg: 'xxxxxxxx access denied'    00025900
         LA    R0,L'MSG7               Length                           00026000
         BAL   R14,TPUT                Write the message on screen      00026100
         BAL   R14,CLOSE               Close RAKFUSER and RAKFSHAD      00026200
         BAL   R14,FREE                Free the data sets               00026300
         B     RC08                    Return code 8                    00026400
ADDU010  CLC   USERUID,USERID          Match found of UserID?           00026500
         BNE   ADDU011                 No: good                         00026600
         MVC   MSG4+14(8),USERID       Involved UserID                  00026700
         LA    R1,MSG4                 Msg: 'UserID already defined'    00026800
         LA    R0,L'MSG4               Length                           00026900
         BAL   R14,TPUT                Write the message on screen      00027000
         BAL   R14,CLOSE               Close the data sets              00027100
         BAL   R14,FREE                Free the data sets               00027200
         B     RC08                    Return code 8                    00027300
ADDU011  DS    0H                                                       00027400
         MVC   0(80,R6),USERREC        Record into table                00027500
         LA    R6,80(,R6)              Next entry in table              00027600
         B     ADDU009                 Read next record                 00027700
USEREOF  DS    0H                      EOF RACFUSER                     00027800
ADDU013  DS    0H                                                       00027900
*---------------------------------------------------------------------* 00028000
*        Read the SHADOW record and check if UserID is already        * 00028100
*        added.                                                       * 00028200
*---------------------------------------------------------------------* 00028300
         GET   RAKFSHAD,SHADOW         Read a shadow record             00028400
         CLC   SHDUID(8),USERID        Match found of UserID?           00028500
         BNE   ADDU013                 No: read next record             00028600
         MVC   MSG4+7(7),USERID        Involved UserID                  00028700
         LA    R1,MSG4                 Msg: 'Userid already defined'    00028800
         LA    R0,L'MSG4               Length                           00028900
         BAL   R14,TPUT                Write the message on screen      00029000
         BAL   R14,CLOSE               Close the data sets              00029100
         BAL   R14,FREE                Free the data sets               00029200
         B     RC08                    Return code 8                    00029300
SHADEOF  DS    0H                      EOF RACFSHAD                     00029400
*---------------------------------------------------------------------* 00029500
*        Write the User records in the User table.                    * 00029600
*---------------------------------------------------------------------* 00029700
         MVC   USERREC,USERREC-1       Clear user record                00029800
         MVC   USERUID(8),USERID       Move UserID                      00029900
         MVI   USERDFT,C'*'            Default group                    00030000
         MVC   USERGRP,DFLTGRP         Default GROUP name               00030100
         MVC   USERSPE,SPECIAL         Special / Nospecial              00030200
         MVC   USEROPR,OPER            Operations / Nooperations        00030300
         MVC   0(80,R6),USERREC        Move record in table             00030400
         LA    R5,1(,R5)               Count record                     00030500
         LA    R1,GROUPS               Group table                      00030600
         LA    R0,5                    Max 5 groups                     00030700
GROUP01  DS    0H                                                       00030800
         CLC   =CL8' ',0(R1)           No groups anymore?               00030900
         BE    GROUP09                 Yes: skip                        00031000
         CLC   DFLTGRP,0(R1)           Group is already the DFLTGRP?    00031100
         BE    GROUP02                 Yes: skip                        00031200
         MVC   USERGRP,0(R1)           Move Group name                  00031300
         MVI   USERDFT,C' '            Is not the Default GROUP         00031400
         LA    R6,80(,R6)              Next entry in User tablew        00031500
         MVC   0(80,R6),USERREC        Move record in table             00031600
         LA    R5,1(,R5)               Count record                     00031700
GROUP02  LA    R1,8(,R1)               Point to next group              00031800
         BCT   R0,GROUP01              Loop until all done              00031900
GROUP09  DS    0H                                                       00032000
*---------------------------------------------------------------------* 00032100
*        Initialize the Salt with the TOD clock and call RAKFPWH      * 00032200
*---------------------------------------------------------------------* 00032300
         STCK  SALT                    Salt = the TOD clock             00032400
         LA    R0,SALT                 Salt                             00032500
         ST    R0,HWPL+0               In parmlist                      00032600
         LA    R0,WORKPASS+1                                            00032700
         ST    R0,HWPL+4               In parmlist                      00032800
         XR    R1,R1                   Clear register                   00032900
         IC    R1,WORKPASS             Gotten password length           00033000
         ST    R1,HWPWLEN              Save in RAKFPWH list             00033100
         LA    R0,HWPWLEN                                               00033200
         ST    R0,HWPL+8               In parmlist                      00033300
         LA    R0,OUTPUT               Output field                     00033400
         ST    R0,HWPL+12              In parmlist                      00033500
         LA    R0,HWWORK               Work area                        00033600
         ST    R0,HWPL+16              In parmlist                      00033700
         LA    R1,HWPL                 Parmlist                         00033800
         ST    R13,HWR13               Save our area address            00033900
         LR    R4,R13                  Save our area address            00034000
         LA    R13,HWSAVE                                               00034100
         L     R15,=V(RAKFPWH)         Hashing routine                  00034200
         BALR  R14,R15                 Encrypt                          00034300
         LR    R13,R4                  Restore our area address         00034400
         BAL   R14,CLOSE               Close RAKFUSER and RAKFSHAD      00034500
*---------------------------------------------------------------------* 00034600
*        Add the salt + hashed password in the SHADOW data set.       * 00034700
*---------------------------------------------------------------------* 00034800
         MVI   OPEND,X'80'             First and only DCB               00034900
         OPEN  (RAKFSHAD,(EXTEND)),MF=(E,OPEND)                         00035000
         TM    SW,$913                 Access denied?                   00035100
         BNO   ADDU015                 No: assumed, that open is succes 00035200
         MVC   MSG3+9(8),=CL8'RAKFSHAD'  DD-name                        00035300
         B     ADDU016                 Write message                    00035400
ADDU015  MVC   SHDUID,USERID                                            00035500
         MVC   SHDSALT,SALT            Salt                             00035600
         MVC   SHDHASH,OUTPUT          Hash                             00035700
         PUT   RAKFSHAD,SHADOW                                          00035800
         MVI   OPEND,X'80'             First and only DCB               00035900
         OPEN  (RAKFUSER,(OUTPUT)),MF=(E,OPEND)                         00036000
         TM    SW,$913                 Access denied?                   00036100
         BNO   ADDU017                 No: assumed, that open is succes 00036200
         MVC   MSG3+9(8),=CL8'RAKFUSER'  DD-name                        00036300
ADDU016  LA    R1,MSG3                 Msg: 'xxxxxxxx access denied'    00036400
         LA    R0,L'MSG3               Length                           00036500
         BAL   R14,TPUT                Write the message on screen      00036600
         BAL   R14,CLOSE               Close the DCBs                   00036700
         BAL   R14,FREE                Free the data sets               00036800
         B     RC08                    Return code 8                    00036900
ADDU017  L     R6,ADRUSER              Max 1000 user entries            00037000
*---------------------------------------------------------------------* 00037100
*        Write the RAKF Users back in the USERS member.               * 00037200
*---------------------------------------------------------------------* 00037300
ADDU019  DS    0H                                                       00037400
         PUT   RAKFUSER,0(R6)          Write ...                        00037500
         LA    R6,80(,R6)                    User ...                   00037600
         BCT   R5,ADDU019                         table back            00037700
         MVC   MSG9+14(8),USERID       UserID in success message        00037800
         LA    R1,MSG9                 Success message                  00037900
         LA    R0,L'MSG9               Length                           00038000
         BAL   R14,TPUT                Write the message on screen      00038100
         LA    R1,MSGA                 Msg: Run RAKFUSER ...            00038200
         LA    R0,L'MSGA               Length                           00038300
         BAL   R14,TPUT                Write the message on screen      00038400
         BAL   R14,CLOSE               Close the data sets              00038500
         BAL   R14,FREE                And unallocate                   00038600
         LA    R15,0                   RC = 0                           00038700
         B     RETURN                                                   00038800
*---------------------------------------------------------------------* 00038900
*        Return to TSO TMP.                                           * 00039000
*---------------------------------------------------------------------* 00039100
RC08     DS    0H                                                       00039200
         LA    R15,8                   RC = 8                           00039300
RETURN   DS    0H                                                       00039400
         LR    R4,R15                  Save return code                 00039500
         LM    R2,R3,PPL#LA            Load length and address of PPL   00039600
         FREEMAIN RU,LV=(2),A=(3)      Free the PPL                     00039700
         ICM   R8,15,ANSWER            Pointer to PDE's (the PDL)       00039800
         BZ    RETURN2                 No: skip                         00039900
         IKJRLSA (R8)                  Release PARSE storage            00040000
RETURN2  L     R2,ADRUSER              Address of user table            00040100
         FREEMAIN RU,LV=104000,A=(2)                                    00040200
         LR    R3,R13                  Load working storage to free     00040300
         L     R13,4(,R13)             Load caller's save area          00040400
         FREEMAIN RU,LV=WORKL,A=(3)    Release working storage          00040500
         LR    R15,R4                  Restore return code              00040600
         RETURN (14,12),RC=(15)        Return                           00040700
*                                                                       00040800
         TITLE 'Invoke IKJDAIR, A(Parm block) in R1'                    00040900
*---------------------------------------------------------------------* 00041000
*        Routine:   CALLTS                                            * 00041100
*        Function:  Invoke IKJDAIR to allocate or unallocate data sets* 00041200
*                   Register 1 contains the address of the allocation * 00041300
*                   or unallocation DAIR parameter blocks.            * 00041400
*---------------------------------------------------------------------* 00041500
CALLTS   DS    0H                                                       00041600
         ST    R14,R14TS               Save register 14                 00041700
         LR    R14,R1                  Save A(IKJDAIR parm block)       00041800
         XC    ECB,ECB                 Clear ECB                        00041900
         LA    R1,DAIRDAPL                                              00042000
         L     R2,MYCPPL               Pickup our CPPL                  00042100
         USING CPPL,R2                 Base CPPL                        00042200
         USING DAPL,R1                 Base IKJDAPL                     00042300
         MVC   DAPLUPT(4),CPPLUPT                                       00042400
         MVC   DAPLECT(4),CPPLECT                                       00042500
         XC    ECB,ECB                 Clear Event control block        00042600
         LA    R0,ECB                  Address of our ECB               00042700
         ST    R0,DAPLECB              Set A(ECB) in DAPL               00042800
         MVC   DAPLPSCB(4),CPPLPSCB                                     00042900
         ST    R14,DAPLDAPB            Set A(parm block) in DAPL        00043000
         CALLTSSR EP=IKJDAIR,MF=(E,DAIRDAPL)                            00043100
         L     R14,R14TS               Restore register 14              00043200
         BR    R14                                                      00043300
         DROP  R1,R2                   Unbase DAPL and CPPL             00043400
         TITLE 'Write message on screen, r0=length, r1=address msg'     00043500
TPUT     DS    0H                                                       00043600
         ST    R14,R14TPUT             Save register 14                 00043700
         TPUT  (1),(0),R                                                00043800
         L     R14,R14TPUT             Restore register 14              00043900
         BR    R14                     Return                           00044000
         TITLE 'Free SYS.SECURE.CNTL and SYS1.SECURE.SHADOW'            00044100
FREE     DS    0H                                                       00044200
         ST    R14,R14FREE             Save register 14                 00044300
         LA    R3,DAIR18               Point to unallocation parm block 00044400
         XC    DAIR18,DAIR18           Clear unallocation parm block    00044500
         USING DAPB18,R3               IKJDAP18                         00044600
         MVI   DA18CD+1,X'18'          Entry code 0018 (unallocate)     00044700
         MVI   DA18MNM,C' '            Provide no ...                   00044800
         MVC   DA18MNM+1(7),DA18MNM               member name           00044900
         MVC   DA18DDN,=CL8'RAKFUSER'  DDNAME to unallocate             00045000
         LR    R1,R3                   Parameter CALLTS                 00045100
         BAL   R14,CALLTS              IKJDAIR routine                  00045200
         MVC   DA18DDN,=CL8'RAKFSHAD'  DDNAME to unallocate             00045300
         LR    R1,R3                   Parameter CALLTS                 00045400
         BAL   R14,CALLTS              IKJDAIR routine                  00045500
         L     R14,R14FREE             Restore register 14              00045600
         BR    R14                     Return                           00045700
         DROP  R3                      Unbase DAPB18                    00045800
         TITLE 'Close RAKFUSER and RAKFSHAD'                            00045900
CLOSE    ST    R14,R14CLOSE            Save register 14                 00046000
         MVI   CLOSED,X'80'            First and only DCB               00046100
         CLOSE RAKFUSER,MF=(E,CLOSED)                                   00046200
         MVI   CLOSED,X'80'            First and only DCB               00046300
         CLOSE RAKFSHAD,MF=(E,CLOSED)                                   00046400
         L     R14,R14CLOSE            Restore register 14              00046500
         BR    R14                     Return                           00046600
         TITLE 'DCB abend exit'                                         00046700
DCBABEND DS    0H                                                       00046800
         TM    3(R1),B'00001110'       Processing allowed?              00046900
         BZR   R14                     No: continue with abend          00047000
         TM    3(R1),4                 Ignore bit on?                   00047100
         MVI   3(R1),0                 Prepare for NO                   00047200
         BZR   R14                                                      00047300
         MVC   DCBCOMP,0(R1)           Move completion code             00047400
         NC    DCBCOMP,=X'FFF0'        Clear last nibble                00047500
         CLC   DCBCOMP,=X'9130'        Do we have an RACF/ACF2 abend?   00047600
         BNER  R14                     No: continue with abend          00047700
         MVI   3(R1),4                 Yes: ignore abend                00047800
         OI    SW,$913                 Indicate 913 abend               00047900
         BR    R14                     Return to Access Method          00048000
PCLSTART DS    0H                                                       00048100
ADDPCL   IKJPARM DSECT=ADDPRS          PDE's                            00048200
UIDPDE   IKJPOSIT JOBNAME,PROMPT='RAKF UserID',                        *00048300
               HELP=('Enter a valid UserID')                            00048400
PASSWKW  IKJKEYWD                                                       00048500
         IKJNAME 'PASSWORD',SUBFLD=PASSWSF,ALIAS='PWD'                  00048600
DFTGRPKW IKJKEYWD                                                       00048700
         IKJNAME 'DFLTGRP',SUBFLD=DGRPSF,ALIAS='DGRP'                   00048800
GROUPKW  IKJKEYWD                                                       00048900
         IKJNAME 'GROUP',SUBFLD=GROUPSF,ALIAS='GRP'                     00049000
OPERKW   IKJKEYWD  DEFAULT='NOOPERATIONS'                               00049100
         IKJNAME 'OPERATIONS'                                           00049200
         IKJNAME 'NOOPERATIONS'                                         00049300
SPECKW   IKJKEYWD DEFAULT='NOSPECIAL'                                   00049400
         IKJNAME 'SPECIAL'                                              00049500
         IKJNAME 'NOSPECIAL'                                            00049600
PASSWSF  IKJSUBF                                                        00049700
PASSWPDE IKJIDENT 'Password',                                          *00049800
               FIRST=ALPHANUM,OTHER=ALPHANUM,MAXLNTH=8,                *00049900
               PROMPT='Enter a valid password',VALIDCK=PWCHK,          *00050000
               HELP='Specify a password with at least 4 characters'     00050100
DGRPSF   IKJSUBF                                                        00050200
DGRPPDE  IKJIDENT 'Default group',                                     *00050300
               FIRST=ALPHA,OTHER=ALPHANUM,MAXLNTH=8,                   *00050400
               PROMPT='Default RAKF group'                              00050500
GROUPSF  IKJSUBF                                                        00050600
GROUPPDE IKJIDENT 'Group',LIST,                                        *00050700
               FIRST=ALPHA,OTHER=ALPHANUM,MAXLNTH=8,                   *00050800
               PROMPT='One or more RAKF groups'                         00050900
         IKJENDP                                                        00051000
PCL#L    EQU   *-PCLSTART                                               00051100
         TITLE 'CONSTANTS'                                              00051200
MDLSHAD  DCB   DSORG=PS,LRECL=48,DDNAME=RAKFSHAD,EODAD=SHADEOF,        *00051300
               MACRF=(GM,PM)                                            00051400
MDLSLEN  EQU   *-MDLSHAD                                                00051500
MDLUSER  DCB   DSORG=PS,LRECL=80,DDNAME=RAKFUSER,EODAD=USEREOF,        *00051600
               MACRF=(GM,PM)                                            00051700
MDLULEN  EQU   *-MDLUSER                                                00051800
*                                                                       00051900
USRDSNL  DC    AL2(L'USRDSN)                                            00052000
USRDSN   DC    C'SYS1.SECURE.CNTL'     RAKF control data set            00052100
SHDDSNL  DC    AL2(L'SHDDSN)                                            00052200
SHDDSN   DC    C'SYS1.SECURE.SHADOW'   RAKF data set with encrypted psw 00052300
*                                                                       00052400
MSG1     DC    C'SYS1.SECURE.USER could not be allocated'               00052500
MSG2     DC    C'SYS1.SECURE.SHADOW could not be allocated'             00052600
MSG3X    DC    C'ADDUSER: xxxxxxxx access denied'  +9                   00052700
MSG4X    DC    C'ADDUSER: User xxxxxxxx already defined'                00052800
MSG5     DC    C'ADDUSER: Parse error'                                  00052900
MSG6     DC    C'ADDUSER: PASSWORD(pppp) and DFLTGRP(gggg) are required*00053000
               '                                                        00053100
MSG7     DC    C'ADDUSER: User table full, too many users'              00053200
MSG9X    DC    C'ADDUSER: User xxxxxxxx successfully defined'           00053300
MSGA     DC    C'ADDUSER: Run RAKFUSER to activate the changes'         00053400
         LTORG ,                                                        00053500
         DROP                                                           00053600
*---------------------------------------------------------------------* 00053700
*        Validate Presence of the Password                            * 00053800
*---------------------------------------------------------------------* 00053900
PWCHK    DS    0H                                                       00054000
         STM   R14,R12,12(R13)         Save registers                   00054100
         LR    R12,R15                 Load base register               00054200
         USING PWCHK,R12                                                00054300
         L     R3,0(,R1)               Point to PASSWORD PDE            00054400
         USING PASSRET,R3              Address it                       00054500
         SR    R15,R15                 Default return code 0            00054600
         TM    PASSFLG,$PWPRES         Was keyword present?             00054700
         BNZ   PW02                    Yes: good                        00054800
         LA    R15,4                   Return code 4                    00054900
PW02     DS    0H                                                       00055000
         LH    R1,PASSL                Length                           00055100
         CH    R1,=H'3'                At least 4 bytes long            00055200
         BH    PWEXIT                  Yes: good                        00055300
         LA    R15,4                   Return code 4                    00055400
PWEXIT   L     R14,12(,R13)            Restore register 14              00055500
         LM    R0,R12,20(R13)          Restore other registers          00055600
         BR    R14                     Return to caller                 00055700
         DROP  R3,R12                  Unbase PASSRET and PWCHK         00055800
         LTORG ,                                                        00055900
*                                                                       00056000
GRPRET   DSECT                         LIST PDE of GROUP                00056100
GRP1PTR  DS    F                       Pointer to GROUP                 00056200
GRP1L    DS    H                       Length of GROUP                  00056300
GRP1FLG  DS    C                                                        00056400
$G1PRES  EQU   128                     Group(s) are present             00056500
         DS    C                       Reserved                         00056600
NEXTGRP  DS    F                       Next PDE                         00056700
*                                                                       00056800
UIDRET   DSECT                         PDE of UserID                    00056900
UIDPTR   DS    F                       Pointer to UserID                00057000
UIDL     DS    H                       Length of UserID                 00057100
UIDFLG   DS    C                                                        00057200
$UPRES   EQU   128                     Group(s) are present             00057300
         DS    C                       Reserved                         00057400
*                                                                       00057500
PASSRET  DSECT                         PDE of Password                  00057600
PASSPTR  DS    F                       Pointer to Password              00057700
PASSL    DS    H                       Length of Password               00057800
PASSFLG  DS    C                                                        00057900
$PWPRES  EQU   128                     Password is present              00058000
         DS    C                       Reserved                         00058100
*                                                                       00058200
DFTGRET  DSECT                         PDE of Default GROUP             00058300
DFTGPTR  DS    F                       Pointer to default group         00058400
DFTGL    DS    H                       Length of group                  00058500
DFTGFLG  DS    C                                                        00058600
$DFPRES  EQU   128                     Default group is present         00058700
         DS    C                       Reserved                         00058800
*                                                                       00058900
WORKAREA DSECT                         Working storage                  00059000
         DS    18F                     Our save area                    00059100
MYCPPL   DS    F                                                        00059200
DAIRDAPL DS    5F                      DAIR parameter list              00059300
ECB      DS    F                       For IKJDAIR                      00059400
R14CLOSE DS    F                       Register 14 CLOSE                00059500
R14FREE  DS    F                       Register 14 FREE                 00059600
R14TPUT  DS    F                       Register 14 TPUT                 00059700
R14TS    DS    F                       Register 14 CALLTS               00059800
EXLST    DS    F                       DCB abend exit                   00059900
OPEND    DS    F                       OPEN MF=L                        00060000
CLOSED   DS    F                       CLOSE MF=L                       00060100
ADRUSER  DS    F                       Address of 1000 user entries     00060200
ANSWER   DS    F                       Parse answer area                00060300
SALT     DS    CL8                     SALT is equal to TOD clock       00060400
USERID   DS    CL8                     To receive UserID                00060500
DFLTGRP  DS    CL8                     To receive default Group name    00060600
*                                                                       00060700
GROUPS   DS    CL40                    To receive max. 5 groups         00060800
*                                                                       00060900
DCBCOMP  DS    H                       Completion code in DCBABEND      00061000
*                                                                       00061100
HASHWKD  DS    0CL772                  Area for RAKFPWH                 00061200
HWPL     DS    5F                    parmlist (salt,pw,pwlen,out,work)  00061300
HWPWLEN  DS    F                       Candidate password length        00061400
HWR13    DS    F                       saved caller save-area pointer   00061500
HWOUT    DS    CL32                    computed SHA-256 hash            00061600
HWSAVE   DS    18F                     save area for the RAKFPWH call   00061700
HWWORK   DS    CL640                   RAKFPWH work area (>= RPWWORKL)  00061800
*                                                                       00061900
OUTPUT   DS    CL32                    Hashed output field              00062000
RAKFSHAD DS    CL(MDLSLEN)                                              00062100
RAKFUSER DS    CL(MDLULEN)                                              00062200
*                                                                       00062300
SHADOW   DS    0CL48                   Shadow record                    00062400
SHDUID   DS    CL8                     UserID (key)                     00062500
SHDSALT  DS    CL8                     SALT                             00062600
SHDHASH  DS    CL32                    HASH                             00062700
*                                                                       00062800
         DS    C                       -1                               00062900
USERREC  DS    0CL80                   User record                      00063000
USERUID  DS    CL8                     Contains UserID                  00063100
USERDFT  DS    C                       * for default group              00063200
USERGRP  DS    CL8                     Group                            00063300
         DS    C                                                        00063400
USERPWD  DS    CL8                     Password is blanked out          00063500
         DS    C                                                        00063600
USEROPR  DS    C                       Operations / Nooperations        00063700
         DS    C                                                        00063800
USERSPE  DS    C                       Special / Nospecial              00063900
         DS    CL50                    Filler                           00064000
*                                                                       00064100
PPL#LA   DS    F                       \___ Length + address PPL ____/  00064200
PPL#PTR  DS    F                       /                             \  00064300
*                                                                       00064400
DAIR08   DS    CL84                    Allocation parm block            00064500
DAIR18   DS    CL40                    Unallocation parm block          00064600
*                                                                       00064700
MSG3     DS    CL(L'MSG3X)                                              00064800
MSG4     DS    CL(L'MSG4X)                                              00064900
MSG9     DS    CL(L'MSG9X)                                              00065000
SW       DS    X                       Flags                            00065100
$913     EQU   128                     913 abend occurred               00065200
*                                                                       00065300
SPECIAL  DS    C                       Y or N for SPECIAL               00065400
OPER     DS    C                       Y or N for OPERATIONS            00065500
WORKPASS DS    CL9                     1 byte length + password         00065600
WORKL    EQU   *-WORKAREA              Length of working storage        00065700
*                                                                       00065800
         CVT   DSECT=YES,LIST=NO                                        00065900
         IKJCPPL                                                        00066000
         IKJUPT                                                         00066100
         IKJPPL                        Parse parameter list             00066200
PPL#L    EQU   *-PPL                                                    00066300
         IKJDAPL                                                        00066400
         IKJDAP08                      IKJDAIR allocation parm block    00066500
         IKJDAP18                      IKJDAIR unallocation parm block  00066600
         PRINT NOGEN                                                    00066700
         DCBD  DSORG=PS,DEVD=DA                                         00066800
*                                                                       00066900
R0       EQU   0                                                        00067000
R1       EQU   1                                                        00067100
R2       EQU   2                                                        00067200
R3       EQU   3                                                        00067300
R4       EQU   4                                                        00067400
R5       EQU   5                       Counter number of USER records   00067500
R6       EQU   6                       Address of USER entry in table   00067600
R7       EQU   7                                                        00067700
R8       EQU   8                       Address of IKJPARS PDL           00067800
R9       EQU   9                                                        00067900
R10      EQU   10                                                       00068000
R11      EQU   11                                                       00068100
R12      EQU   12                      Base register                    00068200
R13      EQU   13                      Address of working storage       00068300
R14      EQU   14                                                       00068400
R15      EQU   15                                                       00068500
         END                                                            00068600
